k6/results/checkout-output.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: F:\Work\Hadha.co\Project\k6\checkout\checkout.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 3m30s max duration (incl. graceful stop):
              * checkout_flow: 5 looping VUs for 3m0s (gracefulStop: 30s)


Run             [ 100% ] setup()
checkout_flow   [   0% ]

running (0m02.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   0% ] 5 VUs  0m00.3s/3m0s

running (0m03.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   1% ] 5 VUs  0m01.3s/3m0s

running (0m04.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   1% ] 5 VUs  0m02.3s/3m0s

running (0m05.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   2% ] 5 VUs  0m03.3s/3m0s

running (0m06.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
checkout_flow   [   2% ] 5 VUs  0m04.3s/3m0s

running (0m07.0s), 5/5 VUs, 4 complete and 0 interrupted iterations
checkout_flow   [   3% ] 5 VUs  0m05.3s/3m0s

running (0m08.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   4% ] 5 VUs  0m06.3s/3m0s

running (0m09.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   4% ] 5 VUs  0m07.3s/3m0s

running (0m10.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   5% ] 5 VUs  0m08.3s/3m0s

running (0m11.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
checkout_flow   [   5% ] 5 VUs  0m09.3s/3m0s

running (0m12.0s), 5/5 VUs, 9 complete and 0 interrupted iterations
checkout_flow   [   6% ] 5 VUs  0m10.3s/3m0s

running (0m13.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   6% ] 5 VUs  0m11.3s/3m0s

running (0m14.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   7% ] 5 VUs  0m12.3s/3m0s

running (0m15.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   7% ] 5 VUs  0m13.3s/3m0s

running (0m16.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
checkout_flow   [   8% ] 5 VUs  0m14.3s/3m0s

running (0m17.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [   9% ] 5 VUs  0m15.3s/3m0s

running (0m18.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [   9% ] 5 VUs  0m16.3s/3m0s

running (0m19.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [  10% ] 5 VUs  0m17.3s/3m0s

running (0m20.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
checkout_flow   [  10% ] 5 VUs  0m18.3s/3m0s

running (0m21.0s), 5/5 VUs, 17 complete and 0 interrupted iterations
checkout_flow   [  11% ] 5 VUs  0m19.3s/3m0s

running (0m22.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  11% ] 5 VUs  0m20.3s/3m0s

running (0m23.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  12% ] 5 VUs  0m21.3s/3m0s

running (0m24.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  12% ] 5 VUs  0m22.3s/3m0s

running (0m25.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
checkout_flow   [  13% ] 5 VUs  0m23.3s/3m0s

running (0m26.0s), 5/5 VUs, 23 complete and 0 interrupted iterations
checkout_flow   [  14% ] 5 VUs  0m24.3s/3m0s

running (0m27.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  14% ] 5 VUs  0m25.3s/3m0s

running (0m28.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  15% ] 5 VUs  0m26.3s/3m0s

running (0m29.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  15% ] 5 VUs  0m27.3s/3m0s

running (0m30.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
checkout_flow   [  16% ] 5 VUs  0m28.3s/3m0s

running (0m31.0s), 5/5 VUs, 29 complete and 0 interrupted iterations
checkout_flow   [  16% ] 5 VUs  0m29.3s/3m0s

running (0m32.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  17% ] 5 VUs  0m30.3s/3m0s

running (0m33.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  17% ] 5 VUs  0m31.3s/3m0s

running (0m34.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  18% ] 5 VUs  0m32.3s/3m0s

running (0m35.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
checkout_flow   [  19% ] 5 VUs  0m33.3s/3m0s

running (0m36.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
checkout_flow   [  19% ] 5 VUs  0m34.3s/3m0s

running (0m37.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
checkout_flow   [  20% ] 5 VUs  0m35.3s/3m0s

running (0m38.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
checkout_flow   [  20% ] 5 VUs  0m36.3s/3m0s

running (0m39.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
checkout_flow   [  21% ] 5 VUs  0m37.3s/3m0s

running (0m40.0s), 5/5 VUs, 38 complete and 0 interrupted iterations
checkout_flow   [  21% ] 5 VUs  0m38.3s/3m0s

running (0m41.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  22% ] 5 VUs  0m39.3s/3m0s

running (0m42.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  22% ] 5 VUs  0m40.3s/3m0s

running (0m43.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  23% ] 5 VUs  0m41.3s/3m0s

running (0m44.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
checkout_flow   [  24% ] 5 VUs  0m42.3s/3m0s

running (0m45.0s), 5/5 VUs, 43 complete and 0 interrupted iterations
checkout_flow   [  24% ] 5 VUs  0m43.3s/3m0s

running (0m46.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
checkout_flow   [  25% ] 5 VUs  0m44.3s/3m0s

running (0m47.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
checkout_flow   [  25% ] 5 VUs  0m45.3s/3m0s

running (0m48.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
checkout_flow   [  26% ] 5 VUs  0m46.3s/3m0s

running (0m49.0s), 5/5 VUs, 46 complete and 0 interrupted iterations
checkout_flow   [  26% ] 5 VUs  0m47.3s/3m0s

running (0m50.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
checkout_flow   [  27% ] 5 VUs  0m48.3s/3m0s

running (0m51.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
checkout_flow   [  27% ] 5 VUs  0m49.3s/3m0s

running (0m52.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
checkout_flow   [  28% ] 5 VUs  0m50.3s/3m0s

running (0m53.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
checkout_flow   [  29% ] 5 VUs  0m51.3s/3m0s

running (0m54.0s), 5/5 VUs, 51 complete and 0 interrupted iterations
checkout_flow   [  29% ] 5 VUs  0m52.3s/3m0s

running (0m55.0s), 5/5 VUs, 54 complete and 0 interrupted iterations
checkout_flow   [  30% ] 5 VUs  0m53.3s/3m0s

running (0m56.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
checkout_flow   [  30% ] 5 VUs  0m54.3s/3m0s

running (0m57.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
checkout_flow   [  31% ] 5 VUs  0m55.3s/3m0s

running (0m58.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
checkout_flow   [  31% ] 5 VUs  0m56.3s/3m0s

running (0m59.0s), 5/5 VUs, 57 complete and 0 interrupted iterations
checkout_flow   [  32% ] 5 VUs  0m57.3s/3m0s

running (1m00.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
checkout_flow   [  32% ] 5 VUs  0m58.3s/3m0s

running (1m01.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
checkout_flow   [  33% ] 5 VUs  0m59.3s/3m0s

running (1m02.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
checkout_flow   [  34% ] 5 VUs  1m00.3s/3m0s

running (1m03.0s), 5/5 VUs, 60 complete and 0 interrupted iterations
checkout_flow   [  34% ] 5 VUs  1m01.3s/3m0s

running (1m04.0s), 5/5 VUs, 64 complete and 0 interrupted iterations
checkout_flow   [  35% ] 5 VUs  1m02.3s/3m0s

running (1m05.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  35% ] 5 VUs  1m03.3s/3m0s

running (1m06.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  36% ] 5 VUs  1m04.3s/3m0s

running (1m07.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  36% ] 5 VUs  1m05.3s/3m0s

running (1m08.0s), 5/5 VUs, 65 complete and 0 interrupted iterations
checkout_flow   [  37% ] 5 VUs  1m06.3s/3m0s

running (1m09.0s), 5/5 VUs, 69 complete and 0 interrupted iterations
checkout_flow   [  37% ] 5 VUs  1m07.3s/3m0s

running (1m10.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
checkout_flow   [  38% ] 5 VUs  1m08.3s/3m0s

running (1m11.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
checkout_flow   [  39% ] 5 VUs  1m09.3s/3m0s

running (1m12.0s), 5/5 VUs, 70 complete and 0 interrupted iterations
checkout_flow   [  39% ] 5 VUs  1m10.3s/3m0s

running (1m13.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
checkout_flow   [  40% ] 5 VUs  1m11.3s/3m0s

running (1m14.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
checkout_flow   [  40% ] 5 VUs  1m12.3s/3m0s

running (1m15.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
checkout_flow   [  41% ] 5 VUs  1m13.3s/3m0s

running (1m16.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
checkout_flow   [  41% ] 5 VUs  1m14.3s/3m0s

running (1m17.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
checkout_flow   [  42% ] 5 VUs  1m15.3s/3m0s

running (1m18.0s), 5/5 VUs, 77 complete and 0 interrupted iterations
checkout_flow   [  42% ] 5 VUs  1m16.3s/3m0s

running (1m19.0s), 5/5 VUs, 79 complete and 0 interrupted iterations
checkout_flow   [  43% ] 5 VUs  1m17.3s/3m0s

running (1m20.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
checkout_flow   [  44% ] 5 VUs  1m18.3s/3m0s

running (1m21.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
checkout_flow   [  44% ] 5 VUs  1m19.3s/3m0s

running (1m22.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
checkout_flow   [  45% ] 5 VUs  1m20.3s/3m0s

running (1m23.0s), 5/5 VUs, 83 complete and 0 interrupted iterations
checkout_flow   [  45% ] 5 VUs  1m21.3s/3m0s

running (1m24.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
checkout_flow   [  46% ] 5 VUs  1m22.3s/3m0s

running (1m25.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
checkout_flow   [  46% ] 5 VUs  1m23.3s/3m0s

running (1m26.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
checkout_flow   [  47% ] 5 VUs  1m24.3s/3m0s

running (1m27.0s), 5/5 VUs, 87 complete and 0 interrupted iterations
checkout_flow   [  47% ] 5 VUs  1m25.3s/3m0s

running (1m28.0s), 5/5 VUs, 88 complete and 0 interrupted iterations
checkout_flow   [  48% ] 5 VUs  1m26.3s/3m0s

running (1m29.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
checkout_flow   [  49% ] 5 VUs  1m27.3s/3m0s

running (1m30.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
checkout_flow   [  49% ] 5 VUs  1m28.3s/3m0s

running (1m31.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
checkout_flow   [  50% ] 5 VUs  1m29.3s/3m0s

running (1m32.0s), 5/5 VUs, 92 complete and 0 interrupted iterations
checkout_flow   [  50% ] 5 VUs  1m30.3s/3m0s

running (1m33.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
checkout_flow   [  51% ] 5 VUs  1m31.3s/3m0s

running (1m34.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
checkout_flow   [  51% ] 5 VUs  1m32.3s/3m0s

running (1m35.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
checkout_flow   [  52% ] 5 VUs  1m33.3s/3m0s

running (1m36.0s), 5/5 VUs, 96 complete and 0 interrupted iterations
checkout_flow   [  52% ] 5 VUs  1m34.3s/3m0s

running (1m37.0s), 5/5 VUs, 97 complete and 0 interrupted iterations
checkout_flow   [  53% ] 5 VUs  1m35.3s/3m0s

running (1m38.0s), 5/5 VUs, 99 complete and 0 interrupted iterations
checkout_flow   [  54% ] 5 VUs  1m36.3s/3m0s

running (1m39.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
checkout_flow   [  54% ] 5 VUs  1m37.3s/3m0s

running (1m40.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
checkout_flow   [  55% ] 5 VUs  1m38.3s/3m0s

running (1m41.0s), 5/5 VUs, 101 complete and 0 interrupted iterations
checkout_flow   [  55% ] 5 VUs  1m39.3s/3m0s

running (1m42.0s), 5/5 VUs, 102 complete and 0 interrupted iterations
checkout_flow   [  56% ] 5 VUs  1m40.3s/3m0s

running (1m43.0s), 5/5 VUs, 104 complete and 0 interrupted iterations
checkout_flow   [  56% ] 5 VUs  1m41.3s/3m0s

running (1m44.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
checkout_flow   [  57% ] 5 VUs  1m42.3s/3m0s

running (1m45.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
checkout_flow   [  57% ] 5 VUs  1m43.3s/3m0s

running (1m46.0s), 5/5 VUs, 106 complete and 0 interrupted iterations
checkout_flow   [  58% ] 5 VUs  1m44.3s/3m0s

running (1m47.0s), 5/5 VUs, 108 complete and 0 interrupted iterations
checkout_flow   [  59% ] 5 VUs  1m45.3s/3m0s

running (1m48.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
checkout_flow   [  59% ] 5 VUs  1m46.3s/3m0s

running (1m49.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
checkout_flow   [  60% ] 5 VUs  1m47.3s/3m0s

running (1m50.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
checkout_flow   [  60% ] 5 VUs  1m48.3s/3m0s

running (1m51.0s), 5/5 VUs, 112 complete and 0 interrupted iterations
checkout_flow   [  61% ] 5 VUs  1m49.3s/3m0s

running (1m52.0s), 5/5 VUs, 113 complete and 0 interrupted iterations
checkout_flow   [  61% ] 5 VUs  1m50.3s/3m0s

running (1m53.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
checkout_flow   [  62% ] 5 VUs  1m51.3s/3m0s

running (1m54.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
checkout_flow   [  62% ] 5 VUs  1m52.3s/3m0s

running (1m55.0s), 5/5 VUs, 116 complete and 0 interrupted iterations
checkout_flow   [  63% ] 5 VUs  1m53.3s/3m0s

running (1m56.0s), 5/5 VUs, 117 complete and 0 interrupted iterations
checkout_flow   [  64% ] 5 VUs  1m54.3s/3m0s

running (1m57.0s), 5/5 VUs, 118 complete and 0 interrupted iterations
checkout_flow   [  64% ] 5 VUs  1m55.3s/3m0s

running (1m58.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
checkout_flow   [  65% ] 5 VUs  1m56.3s/3m0s

running (1m59.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
checkout_flow   [  65% ] 5 VUs  1m57.3s/3m0s

running (2m00.0s), 5/5 VUs, 121 complete and 0 interrupted iterations
checkout_flow   [  66% ] 5 VUs  1m58.3s/3m0s

running (2m01.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
checkout_flow   [  66% ] 5 VUs  1m59.3s/3m0s

running (2m02.0s), 5/5 VUs, 124 complete and 0 interrupted iterations
checkout_flow   [  67% ] 5 VUs  2m00.3s/3m0s

running (2m03.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
checkout_flow   [  67% ] 5 VUs  2m01.3s/3m0s

running (2m04.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
checkout_flow   [  68% ] 5 VUs  2m02.3s/3m0s

running (2m05.0s), 5/5 VUs, 126 complete and 0 interrupted iterations
checkout_flow   [  69% ] 5 VUs  2m03.3s/3m0s

running (2m06.0s), 5/5 VUs, 128 complete and 0 interrupted iterations
checkout_flow   [  69% ] 5 VUs  2m04.3s/3m0s

running (2m07.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
checkout_flow   [  70% ] 5 VUs  2m05.3s/3m0s

running (2m08.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
checkout_flow   [  70% ] 5 VUs  2m06.3s/3m0s

running (2m09.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
checkout_flow   [  71% ] 5 VUs  2m07.3s/3m0s

running (2m10.0s), 5/5 VUs, 132 complete and 0 interrupted iterations
checkout_flow   [  71% ] 5 VUs  2m08.3s/3m0s

running (2m11.0s), 5/5 VUs, 133 complete and 0 interrupted iterations
checkout_flow   [  72% ] 5 VUs  2m09.3s/3m0s

running (2m12.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
checkout_flow   [  72% ] 5 VUs  2m10.3s/3m0s

running (2m13.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
checkout_flow   [  73% ] 5 VUs  2m11.3s/3m0s

running (2m14.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
checkout_flow   [  74% ] 5 VUs  2m12.3s/3m0s

running (2m15.0s), 5/5 VUs, 137 complete and 0 interrupted iterations
checkout_flow   [  74% ] 5 VUs  2m13.3s/3m0s

running (2m16.0s), 5/5 VUs, 138 complete and 0 interrupted iterations
checkout_flow   [  75% ] 5 VUs  2m14.3s/3m0s

running (2m17.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
checkout_flow   [  75% ] 5 VUs  2m15.3s/3m0s

running (2m18.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
checkout_flow   [  76% ] 5 VUs  2m16.3s/3m0s

running (2m19.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
checkout_flow   [  76% ] 5 VUs  2m17.3s/3m0s

running (2m20.0s), 5/5 VUs, 143 complete and 0 interrupted iterations
checkout_flow   [  77% ] 5 VUs  2m18.3s/3m0s

running (2m21.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
checkout_flow   [  77% ] 5 VUs  2m19.3s/3m0s

running (2m22.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
checkout_flow   [  78% ] 5 VUs  2m20.3s/3m0s

running (2m23.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
checkout_flow   [  79% ] 5 VUs  2m21.3s/3m0s

running (2m24.0s), 5/5 VUs, 145 complete and 0 interrupted iterations
checkout_flow   [  79% ] 5 VUs  2m22.3s/3m0s

running (2m25.0s), 5/5 VUs, 147 complete and 0 interrupted iterations
checkout_flow   [  80% ] 5 VUs  2m23.3s/3m0s

running (2m26.0s), 5/5 VUs, 148 complete and 0 interrupted iterations
checkout_flow   [  80% ] 5 VUs  2m24.3s/3m0s

running (2m27.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
checkout_flow   [  81% ] 5 VUs  2m25.3s/3m0s

running (2m28.0s), 5/5 VUs, 150 complete and 0 interrupted iterations
checkout_flow   [  81% ] 5 VUs  2m26.3s/3m0s

running (2m29.0s), 5/5 VUs, 151 complete and 0 interrupted iterations
checkout_flow   [  82% ] 5 VUs  2m27.3s/3m0s

running (2m30.0s), 5/5 VUs, 153 complete and 0 interrupted iterations
checkout_flow   [  82% ] 5 VUs  2m28.3s/3m0s

running (2m31.0s), 5/5 VUs, 155 complete and 0 interrupted iterations
checkout_flow   [  83% ] 5 VUs  2m29.3s/3m0s

running (2m32.0s), 5/5 VUs, 155 complete and 0 interrupted iterations
checkout_flow   [  84% ] 5 VUs  2m30.3s/3m0s

running (2m33.0s), 5/5 VUs, 155 complete and 0 interrupted iterations
checkout_flow   [  84% ] 5 VUs  2m31.3s/3m0s

running (2m34.0s), 5/5 VUs, 156 complete and 0 interrupted iterations
checkout_flow   [  85% ] 5 VUs  2m32.3s/3m0s

running (2m35.0s), 5/5 VUs, 158 complete and 0 interrupted iterations
checkout_flow   [  85% ] 5 VUs  2m33.3s/3m0s

running (2m36.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
checkout_flow   [  86% ] 5 VUs  2m34.3s/3m0s

running (2m37.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
checkout_flow   [  86% ] 5 VUs  2m35.3s/3m0s

running (2m38.0s), 5/5 VUs, 160 complete and 0 interrupted iterations
checkout_flow   [  87% ] 5 VUs  2m36.3s/3m0s

running (2m39.0s), 5/5 VUs, 162 complete and 0 interrupted iterations
checkout_flow   [  87% ] 5 VUs  2m37.3s/3m0s

running (2m40.0s), 5/5 VUs, 163 complete and 0 interrupted iterations
checkout_flow   [  88% ] 5 VUs  2m38.3s/3m0s

running (2m41.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
checkout_flow   [  89% ] 5 VUs  2m39.3s/3m0s

running (2m42.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
checkout_flow   [  89% ] 5 VUs  2m40.3s/3m0s

running (2m43.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
checkout_flow   [  90% ] 5 VUs  2m41.3s/3m0s

running (2m44.0s), 5/5 VUs, 167 complete and 0 interrupted iterations
checkout_flow   [  90% ] 5 VUs  2m42.3s/3m0s

running (2m45.0s), 5/5 VUs, 168 complete and 0 interrupted iterations
checkout_flow   [  91% ] 5 VUs  2m43.3s/3m0s

running (2m46.0s), 5/5 VUs, 170 complete and 0 interrupted iterations
checkout_flow   [  91% ] 5 VUs  2m44.3s/3m0s

running (2m47.0s), 5/5 VUs, 170 complete and 0 interrupted iterations
checkout_flow   [  92% ] 5 VUs  2m45.3s/3m0s

running (2m48.0s), 5/5 VUs, 171 complete and 0 interrupted iterations
checkout_flow   [  92% ] 5 VUs  2m46.3s/3m0s

running (2m49.0s), 5/5 VUs, 173 complete and 0 interrupted iterations
checkout_flow   [  93% ] 5 VUs  2m47.3s/3m0s

running (2m50.0s), 5/5 VUs, 174 complete and 0 interrupted iterations
checkout_flow   [  94% ] 5 VUs  2m48.3s/3m0s

running (2m51.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
checkout_flow   [  94% ] 5 VUs  2m49.3s/3m0s

running (2m52.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
checkout_flow   [  95% ] 5 VUs  2m50.3s/3m0s

running (2m53.0s), 5/5 VUs, 176 complete and 0 interrupted iterations
checkout_flow   [  95% ] 5 VUs  2m51.3s/3m0s

running (2m54.0s), 5/5 VUs, 178 complete and 0 interrupted iterations
checkout_flow   [  96% ] 5 VUs  2m52.3s/3m0s

running (2m55.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
checkout_flow   [  96% ] 5 VUs  2m53.3s/3m0s

running (2m56.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
checkout_flow   [  97% ] 5 VUs  2m54.3s/3m0s

running (2m57.0s), 5/5 VUs, 181 complete and 0 interrupted iterations
checkout_flow   [  97% ] 5 VUs  2m55.3s/3m0s

running (2m58.0s), 5/5 VUs, 182 complete and 0 interrupted iterations
checkout_flow   [  98% ] 5 VUs  2m56.3s/3m0s

running (2m59.0s), 5/5 VUs, 183 complete and 0 interrupted iterations
checkout_flow   [  99% ] 5 VUs  2m57.3s/3m0s

running (3m00.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
checkout_flow   [  99% ] 5 VUs  2m58.3s/3m0s

running (3m01.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
checkout_flow   [ 100% ] 5 VUs  2m59.3s/3m0s

running (3m02.0s), 5/5 VUs, 186 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

running (3m03.0s), 4/5 VUs, 187 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

running (3m04.0s), 3/5 VUs, 188 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

running (3m05.0s), 1/5 VUs, 190 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

running (3m06.0s), 1/5 VUs, 190 complete and 0 interrupted iterations
checkout_flow Ôåô [ 100% ] 5 VUs  3m0s

     Ôûê setup

       Ô£ô setup_products ÔÇö HTTP 2xx

     Ôûê Checkout Pre-Flow

       Ô£ô checkout_view_product ÔÇö HTTP 2xx
       Ô£ô checkout ÔÇö product loaded
       Ô£ù checkout_add_to_cart ÔÇö HTTP 2xx
        Ôå│  96% ÔÇö Ô£ô 184 / Ô£ù 7
       Ô£ù checkout ÔÇö item added to cart
        Ôå│  96% ÔÇö Ô£ô 184 / Ô£ù 7
       Ô£ô checkout_verify_cart ÔÇö HTTP 2xx
       Ô£ù checkout ÔÇö cart has items
        Ôå│  96% ÔÇö Ô£ô 184 / Ô£ù 7
       Ô£ù checkout ÔÇö cart has total
        Ôå│  96% ÔÇö Ô£ô 184 / Ô£ù 7
       Ô£ù checkout_validate_coupon ÔÇö HTTP 2xx
        Ôå│  0% ÔÇö Ô£ô 0 / Ô£ù 191
       Ô£ô checkout_cleanup_cart ÔÇö HTTP 2xx

     api_errors.....................: 198    1.061929/s
     api_latency....................: avg=478.99ms min=757.5┬Ás med=543.94ms max=1.66s   p(90)=902.93ms p(95)=918.86ms
   Ô£ù api_success_rate...............: 79.28% 758 out of 956
     checks.........................: 87.26% 1501 out of 1720
     data_received..................: 4.6 MB 25 kB/s
     data_sent......................: 222 kB 1.2 kB/s
     group_duration.................: avg=3.78s    min=3.2s    med=3.78s    max=4.4s    p(90)=3.92s    p(95)=4.04s   
     http_req_blocked...............: avg=14.25┬Ás  min=0s      med=0s       max=10.46ms p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=2.75┬Ás   min=0s      med=0s       max=527┬Ás   p(90)=0s       p(95)=0s      
   Ô£ô http_req_duration..............: avg=478.99ms min=757.5┬Ás med=543.94ms max=1.66s   p(90)=902.93ms p(95)=918.86ms
       { expected_response:true }...: avg=600.22ms min=336.9ms med=554.04ms max=1.66s   p(90)=909.95ms p(95)=923.71ms
   Ô£ù http_req_failed................: 20.71% 198 out of 956
     http_req_receiving.............: avg=1.14ms   min=0s      med=531.9┬Ás  max=13.84ms p(90)=3.04ms   p(95)=5.4ms   
     http_req_sending...............: avg=2.36┬Ás   min=0s      med=0s       max=589.4┬Ás p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=477.84ms min=727.4┬Ás med=542.67ms max=1.66s   p(90)=901.97ms p(95)=917.74ms
     http_reqs......................: 956    5.127292/s
     iteration_duration.............: avg=4.77s    min=4.18s   med=4.77s    max=5.45s   p(90)=4.95s    p(95)=5.02s   
     iterations.....................: 191    1.024386/s
     vus............................: 1      min=0            max=5
     vus_max........................: 5      min=5            max=5


running (3m06.5s), 0/5 VUs, 191 complete and 0 interrupted iterations
checkout_flow Ô£ô [ 100% ] 5 VUs  3m0s
k6.exe : time="2026-07-16T17:09:45+05:30" level=error msg="thresholds on metrics 'api_success_rate, http_req_failed' 
have been crossed"
At line:1 char:11
+ $Output = & "C:\Users\Admin\AppData\Local\Temp\k6.exe" run "F:\Work\H ...
+           ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (time="2026-07-1...e been crossed":String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError